# LineLoadAllZero Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LoadFailures..::..LineLoadAllZero Property
BuiltInFailures..::..LoadFailures Class See Also
---
Line Load can't have all force components and moment components to be zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LineLoadAllZero { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LineLoadAllZero As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LineLoadAllZero {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LoadFailures Class
Autodesk.Revit.DB Namespace